<?php
/**
 *
 * @package    mahara
 * @subpackage auth-internal
 * @author     Catalyst IT Ltd
 * @license    http://www.gnu.org/copyleft/gpl.html GNU GPL version 3 or later
 * @copyright  For copyright information on Mahara, please see the README file distributed with this software.
 *
 */

defined('INTERNAL') || die();

$string ['internal'] = 'Внутрішній';
$string ['title'] = 'Внутрішній';
$string ['description'] = 'Перевірка автентичності щодо бази даних Mahara';
$string ['completeregistration'] = 'Повна реєстрація';
$string ['emailalreadytaken'] = 'Ця адреса електронної пошти вже зареєстрована тут.';
$string ['emailalreadytakenbyothers'] = 'Ця адреса електронної пошти була взята іншим користувачем.';
$string ['iagreetothetermsandconditions'] = 'Я погоджуюся з Умовами.';
$string ['passwordinvalidform1'] = 'Ваш пароль повинен містити принаймні %s символів. Паролі чутливі до регістру і повинні відрізнятися від вашого імені користувача. Ваш пароль повинен містити %s. ';
$string ['recaptcharegistertitle'] = 'виклик reCAPTCHA';
$string ['recaptcharegisterdesc2'] = 'Поставте галочку в полі "Я не робот", якщо ви хочете продовжити.';
$string ['registeredemailsubject'] = 'Ви зареєструвались на %s';
$string ['Registeredemailmessagetext'] = 'Привіт %s,

Дякуємо за реєстрацію облікового запису на %s. Перейдіть за цим посиланням
завершити процес реєстрації:

%s register.php? ключ = %s

Термін дії посилання закінчується через 24 години.

-
З повагою,
Команда %s ';
$string ['registeredemailmessagehtml'] = '<p> Привіт %s, </p>
<p> Дякуємо за реєстрацію облікового запису на %s. Перейдіть за цим посиланням
Щоб завершити процес реєстрації: </p>
<p> <a href="%sregister.php?key=%s">%s register.php? ключ =%s </a> </p>
<p> Посилання закінчується через 24 години. </p>

<pre> -
З повагою,
Команда %s </pre> ';
$string ['registeredok'] = '<p> Ви успішно зареєструвалися. Перевірте свій обліковий запис електронної пошти, щоб дізнатися, як активувати обліковий запис </p> ';
$string ['registrationexpiredkey'] = 'Вибачте, термін дії ключа закінчився. Можливо, ви чекали більше 24 годин, щоб завершити реєстрацію? Інакше це може бути наша вина. ';
$string ['registrationnosuchid'] = 'На жаль, цей реєстраційний ключ не існує. Можливо, вона вже активована? ';
$string ['registrationnosuchkey1'] = 'На жаль, у нас немає ключа, який відповідає вашому посиланню. Можливо, ваша програма електронної пошти зіпсувала його? ';
$string ['registrationunsuccessful'] = 'Вибачте, ваша спроба реєстрації була невдалою. Це наша вина, а не ваша. Будь-ласка спробуйте пізніше.';
$string ['usernamealreadytaken1'] = 'Вибачте, ви можете використовувати це ім"я користувача. Виберіть нове. ';
$string ['usernameinvalidform'] = 'Імена користувачів можуть містити літери, цифри та найпоширеніші символи і повинні містити від 3 до 30 символів. Пробіли не дозволені. ';
$string ['usernameinvalidadminform'] = 'Імена користувачів можуть містити літери, цифри та найпоширеніші символи і повинні містити від 3 до 236 символів. Пробіли не дозволені. ';
$string ['youmaynotregisterwithouttandc'] = 'Ви не можете зареєструватися, якщо ви не згодні з виконанням <a href="#user_acceptterms"> Загальних положень та умов </a>.';

// реєстрації незавершених установ
$string ['confirmcancelregistration'] = 'Ви впевнені, що хочете скасувати цю реєстрацію? Це призведе до видалення запиту з системи. ';
$string ['confirmemailsubject'] = 'Підтвердження електронної пошти для реєстрації в %s';
$string ['approvalemailsubject'] = 'Отримано запит на реєстрацію в %s';
$string ['odobrenemailmessagetext'] = 'Привіт %s,

Дякуємо за запит облікового запису на %s. Адміністратор установи
повідомлено про вашу заявку. Ви отримаєте інше електронне повідомлення, як
незабаром після розгляду вашої заяви.

-
З повагою,
Команда %s ';
$string ['approvalemailmessagehtml'] = '<p> Привіт %s, </p>
<p> Дякуємо за запит облікового запису на %s. Адміністратор установи
повідомлено про вашу заявку. Ви отримаєте інше електронне повідомлення, як
одразу після розгляду вашої заяви. </p>

<pre> -
З повагою,
Команда %s </pre> ';
$string ['emailconfirmedok'] = '<p> Ви успішно підтвердили свою електронну пошту. Ви отримаєте сповіщення про подальшу реєстрацію. </p> ';
$string ['registrationcancelledok'] = 'Ви успішно скасували заявку на реєстрацію.';
$string ['registrationconfirm'] = 'Підтвердити реєстрацію?';
$string ['registrationconfirmdescription'] = 'Реєстрація повинна бути схвалена адміністраторами установи.';
$string ['registrationdeniedemailsubject'] = 'Спроба реєстрації %s заборонена.';
$string ['registrationdeniedmessage'] = 'Привіт %s,

Ми отримали вашу заявку на приєднання до нашої установи на %s і
вирішив не надавати вам доступ.

Якщо ви вважаєте, що це рішення було неправильним, зв"яжіться зі мною
електронною поштою.

З повагою
%s ';
$string ['registrationdeniedmessagereason'] = 'Привіт %s,

Ми отримали вашу заявку на приєднання до нашої установи на %s і вирішили
не надавати вам доступ з наступних причин:

%s

Якщо ви вважаєте, що це рішення було неправильним, зв"яжіться зі мною
електронною поштою.

З повагою
%s ';
$string ['registeredokawaitingemail2'] = 'Ви успішно подали заявку на реєстрацію. Адміністратор установи отримав сповіщення, і ви отримаєте повідомлення електронної пошти відразу після обробки вашої заяви. ';
$string ['registrationreason'] = 'Причина реєстрації';
$string ['registrationreasondesc1'] = 'Підстава для запиту на реєстрацію у вибраній установі та будь-які інші деталі, які, на вашу думку, можуть бути корисними для адміністратора при обробці вашої заявки. ';

$string ['pendingregistrationadminemailsubject'] = 'Нова реєстрація користувача для "%s "установи в %s.';
$string ['pendingregistrationadminemailtext'] = 'Привіт %s,

Новий користувач запросив приєднатися до установи "%s".

Оскільки ви вказані як адміністратор цієї установи, вам потрібно затвердити чи відхилити цей запит на реєстрацію. Для цього виберіть наступне посилання:%s

Вам потрібно буде затвердити або відхилити цей запит на реєстрацію в межах %s.

Докладна інформація про запит на реєстрацію наведено нижче:

Назва: %s
Електронна пошта: %s
Причина реєстрації:
%s

-
З повагою,
Команда %s ';
$string ['pendingregistrationadminemailhtml'] = '<p> Привіт %s, </p>
<p> Новий користувач запросив приєднатися до установи "%s". </p>
<p> Оскільки ви вказані як адміністратор цієї установи, вам потрібно затвердити чи відхилити цей запит на реєстрацію. Для цього виберіть посилання: <a href="%s">%s </a> </p>
<p> Вам потрібно буде затвердити або відхилити цей запит на реєстрацію в межах %s. </p>
<p> Докладніше про запит на реєстрацію: </p>
<p> Ім"я: %s </p>
<p> Електронна пошта:%s </p>
<p> Причина реєстрації: </p>
<p>%s </p>
<pre> -
З повагою,
Команда %s </pre> ';


// очікує видалення облікового запису користувача
$string ['userdeletionnosuchid'] = 'На жаль, цей запит на видалення не існує. Можливо, вона вже була оцінена? ';
$string ['userdeletiondeniedmessage'] = 'Привіт %s,

Ми отримали ваш запит на видалення облікового запису користувача на %s і
вирішили не видаляти ваші дані.

Якщо ви вважаєте, що це рішення було неправильним, зв"яжіться зі мною
електронною поштою.

З повагою
%s ';
$string ['userdeletiondeniedmessagereason'] = 'Привіт %s,

Ми отримали ваш запит на видалення облікового запису користувача на %s і вирішили
не видаляти дані з наступної причини:

%s

Якщо ви вважаєте, що це рішення було неправильним, зв"яжіться зі мною
електронною поштою.

З повагою
%s ';
$string ['userdeletiondeniedemailsubject'] = 'Спроба видалення облікового запису користувача на %s заборонена.';
$string ['userdeletionemailsubject'] = 'Ваш обліковий запис користувача було видалено з %s';
$string ['userdeletionemailmessagetext'] = 'Привіт %s,

Ваш обліковий запис користувача успішно видалено з %s.

-
З повагою,
Команда %s ';
$string ['userdeletionemailmessagehtml'] = '<p> Привіт %s, </p>
<p> Ваш обліковий запис успішно видалено з %s. </p>

<pre> -
З повагою,
Команда %s </pre> ';
