<?php
/**
 *
 * @package    mahara
 * @subpackage lang
 * @author     Catalyst IT Ltd
 * @license    http://www.gnu.org/copyleft/gpl.html GNU GPL version 3 or later
 * @copyright  For copyright information on Mahara, please see the README file distributed with this software.
 *
 */

defined('INTERNAL') || die();

// @todo <nigel>: швидше за все, тут потрібні набагато кращі описи цих проблем навколишнього середовища
$string ['phpversion'] = 'Mahara не буде працювати на PHP < %s. Оновіть версію PHP або перемістіть Mahara на інший хост. ';
$string ['jsonextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення JSON. Mahara вимагає цього, щоб надіслати деякі дані до та з браузера. Переконайтеся, що він прописаний у php.ini або встановіть його, якщо він не встановлений. ';
$string ['pgsqldbextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення pgsql. Mahara вимагає цього, щоб зберігати дані в реляційній базі даних. Переконайтеся, що він прописаний у php.ini або встановіть його, якщо він не встановлений. ';
$string ['mysqldbextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення mysqli або mysql. Mahara вимагає цього, щоб зберігати дані в реляційній базі даних. Переконайтеся, що він прописаний у php.ini або встановіть його, якщо він не встановлений. ';
$string ['mysqlmodulenolongersupported1'] = 'Конфігурація вашого сервера не включає розширення mysqli. Переконайтеся, що він прописаний у php.ini або встановіть його, якщо він не встановлений. Mahara перестав підтримувати розширення mysql у версії 16.10 ';
$string ['unknowndbtype'] = 'Ваша конфігурація сервера посилається на невідомий тип бази даних. Дійсними значеннями є «postgres» або «mysql». Будь ласка, змініть налаштування типу бази даних у config.php. ';
$string ['domextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення dom. Mahara вимагає цього, щоб розібрати дані XML з різних джерел. ';
$string ['xmlextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення %s. Mahara вимагає цього, щоб розібрати XML-дані з різних джерел. Переконайтеся, що він прописаний у php.ini або встановіть його, якщо він не встановлений. ';
$string ['gdextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення gd. Mahara вимагає цього, щоб виконувати зміни розмірів та інші операції над завантаженими зображеннями. Переконайтеся, що він прописаний у php.ini або встановіть його, якщо він не встановлений. ';
$string ['gdfreetypenotloaded'] = 'Розширення gd вашого сервера не має підтримки Freetype. Зробіть так, щоб розширення gd мало таку підтримку. ';
$string ['sessionextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення session. Mahara вимагає цього, щоб підтримувати користувачів, що входять до системи. Переконайтеся, що воно прописано у php.ini або встановіть, якщо не встановлено. ';
$string ['curllibrarynotinstalled'] = 'Конфігурація вашого сервера не включає розширення curl. Mahara вимагає цього для інтеграції Moodle і для отримання зовнішніх каналів. Переконайтеся, що curl прописаний у php.ini або встановіть його, якщо він не встановлений. ';
$string ['registerglobals'] = 'У вас є небезпечні налаштування PHP: увімкнено register_globals. Mahara намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag register_globals off ';
$string ['magicquotesgpc'] = 'Ви маєте небезпечні налаштування PHP: magic_quotes_gpc увімкнено. Mahara намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag magic_quotes_gpc off';
$string ['magicquotesruntime'] = 'Ви маєте небезпечні налаштування PHP: magic_quotes_runtime увімкнено. Mahara намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг, і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag magic_quotes_runtime off ';
$string ['magicquotessybase'] = 'У вас є небезпечні налаштування PHP: magic_quotes_sybase увімкнено. Mahara намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг, і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag magic_quotes_sybase off ';

$string ['safemodeon'] = 'Ваш сервер, здається, працює у безпечному режимі. Mahara не підтримує роботу у безпечному режимі. Ви повинні вимкнути це у файлі php.ini або в конфігурації apache для сайту.

Якщо ви перебуваєте на спільному хостингу, цілком імовірно, що ви мало що можете зробити, щоб вимкнути безпечний режим, окрім запитання до провайдера. Можливо, вам потрибно розглянути можливість переходу на інший хост. ';
$string ['apcstatoff'] = 'Схоже, ваш сервер працює з APC з apc.stat=0. Mahara не підтримує цю конфігурацію. У файлі php.ini потрібно встановити apc.stat=1.

Якщо ви перебуваєте на спільному хостингу, цілком імовірно, що ви мало що можете зробити, щоб увімкнути apc.stat, окрім запитання до провайдера хостингу. Можливо, вам потрибно розглянути можливість переходу на інший хост. ';
$string ['datarootinsidedocroot'] = 'Ви налаштували data root на вашу теку документів. Це велика проблема безпеки, оскільки кожен може безпосередньо запитувати дані сеансу (для того, щоб захопити сеанси інших людей) або файли, до яких їм не дозволено доступ, які інші користувачі завантажили. Налаштуйте data root так, щоб він знаходився поза текою документів. ';
$string ['datarootnotwritable'] = 'Ваш data root каталог, %s, не відкритий для запису. Це означає, що на сервері не може бути збережено ні дані сесії, ні файли користувачів, ні що-небудь інше, що потрібно завантажити. Будь ласка, зробіть каталог, якщо він не існує, або надайте право власності на каталог користувачеві веб-сервера, якщо він є. ';
$string ['sessionpathnotwritable'] = 'Ваш каталог session data, %s, не відкритий для запису. Будь ласка, створіть каталог, якщо він не існує, або надайте право власності на каталог користувачеві веб-сервера, якщо він є. ';
$string ['wwwrootnothttps'] = 'Визначений вами wwwroot, %s, не є HTTPS. Проте інші налаштування (наприклад, sslproxy) вимагають, щоб ваш wwwroot був адресою HTTPS.

Оновіть налаштування wwwroot як адресу HTTPS або виправте неправильні налаштування. ';
$string ['couldnotmakedatadirectories'] = 'З деяких причин деякі з основних каталогів даних не можуть бути створені. Це не повинно відбуватися, коли Mahara раніше виявив, що директорія dataroot була доступна для запису. Перевірте права доступу до каталогу dataroot. ';

$string ['dbconnfailed'] = 'Mahara не може підключитися до бази даних застосунків.

 * Якщо ви користуєтеся Mahara, зачекайте хвилину і повторіть спробу
 * Якщо ви адміністратор, перевірте налаштування бази даних і переконайтеся, що база даних доступна

Отримана помилка:
';
$string ['dbnotutf8'] = 'Ви не використовуєте базу даних на UTF-8. Mahara зберігає всі дані як UTF-8 внутрішньо. Будь ласка, введіть та створіть базу даних за допомогою кодування UTF-8. ';
$string ['dbversioncheckfailed'] = 'Ваша версія сервера баз даних не достатньо нова для успішного запуску Mahara. Ваш сервер %s %s, але Mahara вимагає принаймні версію %s. ';
$string ['plpgsqlnotavailable'] = 'Мова PL/pgSQL не активована у вашій Postgres і Mahara не може включити його. Будь ласка, встановіть PL/pgSQL у вашій базі даних вручну. Щоб дізнатися, як це зробити, див. https://wiki.mahara.org/wiki/System_Administrator_Guide/Enabling_Plpgsql ';
$string ['mysqlnotriggerprivilege'] = 'Mahara вимагає дозволу на створення тригерів бази даних, але не може це зробити. Переконайтеся, що привілей тригера надано відповідному користувачеві у ваших налаштуваннях MySQL. Щоб дізнатися, як це зробити, див. https://wiki.mahara.org/wiki/System_Administrator_Guide/Granting_Trigger_Privilege ';
$string ['mbstringneeded'] = 'Будь ласка, встановіть розширення mbstring для php. Це необхідно, якщо в іменах користувачів є символи UTF-8. Інакше користувачі не зможуть увійти в систему. ';
$string ['cssnotpresent'] = 'Файли CSS відсутні у вашому каталозі htdocs/theme/raw/style. Якщо ви запускаєте Mahara з Git Checkout, запустіть "make css" для створення CSS-файлів. Якщо ви запускаєте Mahara з завантаження ZIP, спробуйте завантажити та розпакувати ще раз. ';
$string ['mahararootusermissing'] = 'Користувач "root" відсутній у базі даних, тому ми не можемо продовжувати. Цей користувач повинен бути присутнім для правильного функціонування Mahara. Щоб додати кореневого користувача, будь ласка, зробіть іншу інсталяцію версії Mahara, яку ви використовуєте і подивіться, що міститься в user id = 0 в таблицях "usr" і "usr_custom_layout". Додайте ці дані до вашого примірника Mahara до намагання оновлення знову. ';

// повідомлення про помилки загального виключення
$string ['blocktypenametaken'] = 'Тип блоку %s вже зайнятий іншим плагіном (%s).';
$string ['artefacttypenametaken'] = 'Тип артефакту %s вже зайнятий іншим плагіном (%s).';
$string ['artefacttypemismatch'] = 'Невідповідність типу артефакту. Ви намагаєтеся використовувати цей %s як %s.';
$string ['classmissing'] = 'клас %s для типу %s у плагіні %s відсутній.';
$string ['artefacttypeclassmissing'] = 'Тип артефакту повинні включати клас. Відсутній %s.';
$string ['artefactpluginmethodmissing'] = 'Плагін артефакту %s повинен виконувати %s і не має.';
$string ['blocktypelibmissing'] = 'Відсутній lib.php для блоку %s в артефакті плагіна %s.';
$string ['unabletosetmultipleblogs'] = 'Увімкнення декількох журналів для користувача %s при копіюванні сторінки %s не вдалося. Це можна встановити вручну на сторінці <a href="%s">облікового запису</a>. ';
$string ['pleaseloginforjournals'] = 'Ви повинні вийти з системи й увійти назад, перш ніж ви побачите всі журнали та публікації.';
$string ['blocktypemissingconfigform'] = 'Тип блоку %s повинен виконувати instance_config_form.';
$string ['versionphpmissing1'] = 'Плагін %s %s відсутній version.php. Якщо ви не очікуєте мати плагін %s, видаліть папку на %s. ';
$string ['blocktypeprovidedbyartefactnotinstallable'] = 'Це буде встановлено як частину інсталяції артефакту %s.';
$string ['blockconfigdatacalledfromset'] = 'Configdata не слід встановлювати безпосередньо. Замість цього використовуйте PluginBlocktype::instance_config_save. ';
$string ['invaliddirection '] = ' Неправильний напрямок %s. ';
$string ['onlyoneprofileviewallowed'] = 'Вам дозволяється лише одна сторінка профілю.';
$string ['onlyoneblocktypeperview'] = 'Неможливо помістити більше ніж один тип блоку %s на сторінку.';

// якщо ви зміните наступні два, обов'язково змініть їх у libroot / errors.php
// якщо вони дубльовані там, у випадку, коли get_string недоступний.
$string ['unrecoverableerror'] = 'Сталася непоправна помилка. Це, мабуть, означає, що ви зіткнулися з помилкою в системі. ';
$string ['unrecoverableerrortitle'] = '%s - Сайт недоступний';
$string ['parameterexception'] = 'Необхідний параметр відсутній.';

$string ['notfound'] = 'Не знайдено';
$string ['notfoundexception'] = 'Сторінку, яку ви шукаєте, не знайдено.';

$string ['accessdenied'] = 'Доступ заборонений';
$string ['accessdeniedobjection'] = 'Відхилено доступ. Заперечення вже вирішено іншим адміністратором. ';
$string ['accessdeniedsuspension'] = 'Цей портфоліо знаходиться на розгляді.';
$string ['accessdeniedexception'] = 'У вас немає доступу для перегляду цієї сторінки.';
$string ['accessdeniednourlsecret'] = 'Ви не маєте доступу до цього функціоналу. Будь ласка, вкажіть значення «urlsecret» з вашого файлу config.php як частину URL. ';
$string ['accessdeniedbadge'] = 'У вас немає доступу для перегляду цієї відзнаки.';
$string ['siteprivacystatementnotfound'] = 'Заяву про конфіденційність сайту з ідентифікатором %s не знайдено.';
$string ['institutionprivacystatementnotfound'] = 'Заяву про конфіденційність для «%s» з ідентифікатором %s не знайдено.';
$string ['viewnotfoundexceptiontitle'] = 'Сторінку не знайдено';
$string ['viewnotfoundexceptionmessage'] = 'Ви намагалися отримати доступ до сторінки, якої не існує.';
$string ['viewnotfound'] = 'Сторінка з id %s не знайдена.';
$string ['viewnotfoundbyname'] = 'Сторінка %s від %s не знайдена.';
$string ['youcannotviewthisusersprofile'] = 'Ви не можете переглядати профайл користувача(ів).';
$string ['invalidlayoutselection'] = 'Ви намагалися вибрати макет, якого не існує.';
$string ['invalidnumrows'] = 'Ви спробували створити макет з більшою допустимою кількістю рядків. (Це неможливо. Повідомте адміністратора вашого сайту.) ';
$string ['previewimagegenerationfailed'] = 'Вибачте, виникла проблема генерації попереднього перегляду зображення.';
$string ['viewtemplatenotfound'] = 'Шаблон сторінки за замовчанням не знайдено.';

$string ['artefactnotfoundmaybedeleted'] = 'Не знайдено артефакт з id %s (можливо, його вже видалено?)';
$string ['artefactnotfound'] = 'Артефакт з id %s не знайдено';
$string ['artefactsnotfound'] = 'Не знайдено жодного артефакту з ідентифікатором(ами): %s';
$string ['artefactnotinview'] = 'Артефакт %s не на сторінці %s';
$string ['artefactonlyviewableinview'] = 'Артефакти цього типу доступні лише для сторінки.';
$string ['notartefactowner'] = 'Ви не є власником цього артефакту.';

$string ['blockinstancenotfound'] = 'Екземпляр блоку з id %s не знайдено.';
$string ['interactioninstancenotfound'] = 'Екземпляр діяльності з id %s не знайдено.';

$string ['invalidviewaction'] = 'Недійсна дія контролю сторінки: %s';

$string ['missingparamblocktype'] = 'Спробуйте вибрати тип блоку, який потрібно додати першим.';
$string ['missingparamcolumn'] = 'Відсутня специфікація стовпця';
$string ['missingparamrow'] = 'Відсутня специфікація рядка';
$string ['missingparamorder'] = 'Немає специфікації замовлення';
$string ['missingparamid'] = 'Відсутній ідентифікатор';

$string ['themenameinvalid'] = 'Назва теми «%s» містить недопустимі символи.';

$string ['timezoneidentifierunusable'] = 'PHP на хості вашого сайту не повертає корисного значення для ідентифікатора часового поясу (%%z) - певне форматування дати, наприклад, під час експорту Leap2A буде порушено. %%z є кодом форматування дати PHP. Ця проблема зазвичай пов\'язана з обмеженням у роботі PHP у Windows.';
$string ['postmaxlessthanuploadmax'] = 'Ваш параметр PHP post_max_size (%s) менше, ніж параметр upload_max_filesize (%s). Завантаження, що перевищує %s, буде показувати помилку. Зазвичай post_max_size має бути набагато більшим, ніж upload_max_filesize.';
$string ['smallpostmaxsize'] = 'Ваше налаштування PHP post_max_size (%s) дуже мале. Завантаження, розмір яких перевищує %s, не зникне без показу помилки.';
$string ['notenoughsessionentropy'] = 'Ваше налаштування PHP session.entropy_length занадто мале. Встановіть його як мінімум 16 у вашому php.ini, щоб гарантувати, що згенеровані IDs сеансів є випадковими та непередбачуваними. ';
$string ['switchtomysqli'] = 'Розширення PHP <strong>mysqli</strong> не встановлено на вашому сервері. Таким чином, Mahara повертається до застарілого оригінального розширення PHP mysql </strong>. Рекомендується встановити <a href="http://php.net/manual/en/book.mysqli.php">mysqli</a>. ';
$string ['noreplyaddressmissingorinvalid'] = 'Налаштування noreply адреси є порожнім або має недійсну адресу електронної пошти. Перевірте налаштування в <a href="%s">параметрах сайту, розділі налаштування електронної пошти</a>. ';
$string ['openbasedirenabled'] = 'Ваш сервер має включене обмеження php open_basedir.';
$string ['openbasedirpaths'] = 'Mahara може відкривати лише файли в межах наступного шляху: %s. ';
$string ['openbasedirwarning'] = 'Деякі запити на зовнішні сайти можуть не завершитися. Це може зупинити оновлення певних каналів. ';
$string ['resavecustomthemes'] = 'Ваше останнє оновлення може зупинити відображення правильно налаштованих тем. Для оновлення налаштування теми, перейдіть до Адміністрування -> Заклад -> Налаштування, налаштуйте налаштування закладу та збережіть форму.<br>Наступні заклади використовують налаштування теми: ';

$string ['gdlibrarylacksgifsupport'] = 'Встановлена ​​бібліотека PHP GD не підтримує створення і читання зображень GIF. Потрібна повна підтримка для завантаження зображень GIF.';
$string ['gdlibrarylacksjpegsupport'] = 'Встановлена ​​бібліотека PHP GD не підтримує зображення JPEG/JPG. Потрібна повна підтримка для завантаження зображень JPEG/JPG. ';
$string ['gdlibrarylackspngsupport'] = 'Встановлена ​​бібліотека PHP GD не підтримує зображення PNG. Потрібна повна підтримка для завантаження зображень PNG. ';

$string ['nopasswordsaltset'] = 'Не встановлено пароль для всього сайту. Відредагуйте ваш config.php і встановіть параметр "passwordsaltmain" та секретну фразу. ';
$string ['passwordsaltweak'] = 'Ваш пароль для сайту не є достатньо складним. Відредагуйте config.php і встановіть параметр «passwordsaltmain» на більш довгу секретну фразу.';
$string ['urlsecretweak'] = 'Встановлений $cfg->urlsecret для цього сайту не змінювався від значення за замовчуванням. Відредагуйте свій config.php і встановіть для параметра $cgf->urlsecret інше значення (або null, якщо ви не бажаєте використовувати urlsecret). ';
$string ['notproductionsite'] = 'Цей сайт не знаходиться у режимі розробки. Деякі дані можуть бути недоступними та/або можуть бути застарілими.';
$string ['badsessionhandle'] = 'Обробник сесії «%s» не налаштований правильно. Перевірте налаштування у файлі «config.php».';
$string ['wrongsessionhandle'] = 'Обробник сесії збереження «%s» не підтримується в Mahara.';
$string ['nomemcachedserver'] = 'Сервер memcache «%s» недоступний. Будь ласка, перевірте значення $cfg->memcacheservers, щоб переконатися, що він правильний.';
$string ['nophpextension'] = 'Розширення PHP «%s» не включено. Увімкніть розширення та перезапустіть веб-сервер або виберіть іншу опцію сесії. ';
$string ['nomemcacheserversdefined'] = 'Обробник сеансу збереження «%s» не має визначених відповідних серверів. Установіть значення $ cfg-> memcacheservers, наприклад "localhost: 11211". ';
$string ['memcacheusememcached'] = '«memcache» зберігання сесії є застарілим. Використовуйте «memcached». ';
$string ['siteoutofsyncfor'] = 'Цей сайт містить інформацію про базу даних більш нову, ніж файли %s які вказують, що він повинен бути.';
$string ['updatesitetimezone'] = 'Часовий пояс для сайту тепер потрібно встановити через Конфігурація сайту -> Параметри сайту -> Налаштування сайту. Встановіть його там і видаліть рядок $cfg->dbtimezone з вашого файлу config.php. ';
$string ['pluginnotactive1'] = 'Плагін «%s» не ввімкнено. Щоб увімкнути його, перейдіть до розділу Адміністрування -> Розширення -> Адміністрування плагінів.';