<?php
/**
 *
 * @package    mahara
 * @subpackage lang
 * @author     Catalyst IT Ltd
 * @license    http://www.gnu.org/copyleft/gpl.html GNU GPL version 3 or later
 * @copyright  For copyright information on Mahara, please see the README file distributed with this software.
 *
 */

defined('INTERNAL') || die();

// @todo <nigel>: швидше за все, тут потрібні набагато кращі описи цих проблем навколишнього середовища
$string ['phpversion'] = 'Mahara не буде працювати на PHP < % s. Оновіть версію PHP або перемістіть Mahara на інший хост. ';
$string ['jsonextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення JSON. Махара вимагає цього, щоб надіслати деякі дані до та з браузера. Переконайтеся, що він завантажений у php.ini або встановіть його, якщо він не встановлений. ';
$string ['pgsqldbextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення pgsql. Махара вимагає цього, щоб зберігати дані в реляційній базі даних. Переконайтеся, що він завантажений у php.ini або встановіть його, якщо він не встановлений. ';
$string ['mysqldbextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення mysqli або mysql. Махара вимагає цього, щоб зберігати дані в реляційній базі даних. Переконайтеся, що він завантажений у php.ini або встановіть його, якщо він не встановлений. ';
$string ['mysqlmodulenolongersupported1'] = 'Конфігурація вашого сервера не включає розширення mysqli. Переконайтеся, що він завантажений у php.ini або встановіть його, якщо він не встановлений. Mahara перестав підтримувати розширення mysql у версії 16.10 ';
$string ['unknowndbtype'] = 'Ваша конфігурація сервера посилається на невідомий тип бази даних. Дійсними значеннями є "postgres" і "mysql". Будь ласка, змініть налаштування типу бази даних у config.php. ';
$string ['domextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення dom. Махара вимагає цього, щоб розібрати дані XML з різних джерел. ';
$string ['xmlextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення% s. Махара вимагає цього, щоб розібрати XML-дані з різних джерел. Переконайтеся, що він завантажений у php.ini або встановіть його, якщо він не встановлений. ';
$string ['gdextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення gd. Махара вимагає цього, щоб виконувати зміни розмірів та інші операції над завантаженими зображеннями. Переконайтеся, що він завантажений у php.ini або встановіть його, якщо він не встановлений. ';
$string ['gdfreetypenotloaded'] = 'Ваша конфігурація сервера розширення gd не включає підтримку Freetype. Переконайтеся, що з ним налаштовано gd. ';
$string ['sessionextensionnotloaded'] = 'Конфігурація вашого сервера не включає розширення сеансу. Mahara вимагає цього, щоб підтримувати користувачів, що входять до системи. Переконайтеся, що він завантажений у php.ini або встановлений, якщо він не встановлений. ';
$string ['curllibrarynotinstalled'] = 'Конфігурація вашого сервера не включає розширення скрутки. Махара вимагає цього для інтеграції Moodle і для отримання зовнішніх каналів. Переконайтеся, що curl завантажений у php.ini або встановіть його, якщо він не встановлений. ';
$string ['registerglobals'] = 'У вас є небезпечні налаштування PHP: увімкнено register_globals. Махара намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг, і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag register_globals off ';
$string ['magicquotesgpc'] = 'Ви маєте небезпечні налаштування PHP: magic_quotes_gpc увімкнено. Махара намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг, і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag magic_quotes_gpc off ';
$string ['magicquotesruntime'] = 'Ви маєте небезпечні налаштування PHP: magic_quotes_runtime увімкнено. Махара намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг, і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag magic_quotes_runtime off ';
$string ['magicquotessybase'] = 'У вас є небезпечні налаштування PHP: magic_quotes_sybase увімкнено. Махара намагається обійти це, але ви дійсно повинні це виправити. Якщо ви використовуєте спільний хостинг, і ваш хост дозволяє це, вам слід додати наступний рядок у вашому файлі .htaccess:
php_flag magic_quotes_sybase off ';

$string ['safemodeon'] = 'Ваш сервер, здається, працює у безпечному режимі. Махара не підтримує роботу в безпечному режимі. Ви повинні вимкнути це у файлі php.ini або в конфігурації apache для сайту.

Якщо ви перебуваєте на спільному хостингу, цілком імовірно, що ви мало що можете зробити, щоб вимкнути безпечний режим, окрім запитайте провайдера. Можливо, ви можете розглянути можливість переходу на інший хост. ';
$string ['apcstatoff'] = 'Схоже, ваш сервер працює з APC з apc.stat = 0. Махара не підтримує цю конфігурацію. У файлі php.ini потрібно встановити apc.stat = 1.

Якщо ви перебуваєте на спільному хостингу, цілком імовірно, що ви мало що можете зробити, щоб увімкнути apc.stat, окрім запитання провайдера хостингу. Можливо, ви можете розглянути можливість переходу на інший хост. ';
$string ['datarootinsidedocroot'] = 'Ви встановили корінь даних, що знаходиться в корені документа. Це великий профі для безпеки тому що будь-хто може безпосередньо запитувати дані сеансу (для того, щоб захопити сеанси інших людей) або файли, яким їм не дозволено доступ, які інші користувачі завантажили. Будь ласка, налаштуйте корінь даних, що знаходиться за межами кореня документа. ';
$string ['datarootnotwritable'] = 'Ваш визначений кореневий каталог даних, % s, не можна записувати. Це означає, що на сервері не може бути збережено ні дані сесії, ні файли користувачів, ні що-небудь інше, що потрібно завантажити. Будь ласка, зробіть каталог, якщо він не існує, або надайте право власності на каталог користувачеві веб-сервера, якщо він є. ';
$string ['sessionpathnotwritable'] = 'Ваш каталог даних сеансу, % s, не можна записувати. Будь ласка, створіть каталог, якщо він не існує, або надайте право власності на каталог користувачеві веб-сервера, якщо він це зробить. ';
$string ['wwwrootnothttps'] = 'Ваша визначена сторінка, % s, не є HTTPS. Проте інші налаштування (наприклад, sslproxy) для встановлення вимагають, щоб ваш wwwroot був адресою HTTPS.

Оновіть налаштування wwwroot як адресу HTTPS або виправте неправильні налаштування. ';
$string ['couldnotmakedatadirectories'] = 'З деяких причин деякі з основних каталогів даних не можуть бути створені. Це не повинно відбуватися, коли Махара раніше виявив, що директорія dataroot була доступна для запису. Перевірте права доступу до каталогу dataroot. ';

$string ['dbconnfailed'] = 'Mahara не може підключитися до бази даних програм.

 * Якщо ви користуєтеся Mahara, зачекайте хвилину і повторіть спробу
 * Якщо ви адміністратор, перевірте налаштування бази даних і переконайтеся, що база даних доступна

Отримана помилка:
';
$string ['dbnotutf8'] = 'Ви не використовуєте базу даних UTF-8. Mahara зберігає всі дані як UTF-8 внутрішньо. Будь ласка, введіть та створіть базу даних за допомогою кодування UTF-8. ';
$string ['dbversioncheckfailed'] = 'Ваша версія сервера баз даних не достатньо нова для успішного запуску Mahara. Ваш сервер - % s % s, але Mahara вимагає принаймні версії % s. ';
$string ['plpgsqlnotavailable'] = 'Мова PL / pgSQL не активована у вашій Postgres, і Mahara не може включити його. Будь ласка, встановіть PL / pgSQL у вашу базу даних вручну. Щоб дізнатися, як це зробити, див. Https://wiki.mahara.org/wiki/System_Administrator_Guide/Enabling_Plpgsql ';
$string ['mysqlnotriggerprivilege'] = 'Mahara вимагає дозволу на створення тригерів бази даних, але не може зробити це. Переконайтеся, що привілей тригера надано відповідному користувачеві у вашій установці MySQL. Щоб дізнатися, як це зробити, див. Https://wiki.mahara.org/wiki/System_Administrator_Guide/Granting_Trigger_Privilege ';
$string ['mbstringneeded'] = 'Будь ласка, встановіть розширення mbstring для php. Це необхідно, якщо в іменах користувачів є символи UTF-8. Інакше користувачі не зможуть увійти в систему. ';
$string ['cssnotpresent'] = 'Файли CSS відсутні у вашому каталозі htdocs / theme / raw / style. Якщо ви запускаєте Mahara з Git Checkout, запустіть "make css" для створення CSS-файлів. Якщо ви запускаєте Mahara з завантаження ZIP, спробуйте завантажити та розпакувати ще раз. ';
$string ['mahararootusermissing'] = 'Користувач "root" відсутній у базі даних, тому ми не можемо продовжувати. Цей користувач повинен бути присутнім для правильного функціонування Mahara. Щоб додати кореневого користувача назад, будь ласка, зробіть іншу інсталяцію версії Mahara, яку ви використовуєте, і подивіться, що міститься в імені користувача = 0 в таблицях "usr" і "usr_custom_layout", і додайте ці дані до вашого примірника Mahara до намагаються оновити знову. ';

// повідомлення про помилки загального виключення
$string ['blocktypenametaken'] = 'Тип блоку % s вже зайнятий іншим плагіном (% s).';
$string ['artefacttypenametaken'] = 'Тип артефакту % s вже зайнятий іншим плагіном (% s).';
$string ['artefacttypemismatch'] = 'Невідповідність типу артефакту. Ви намагаєтеся використовувати цей % s як % s.';
$string ['classmissing'] = 'Клас % s для типу % s у плагіні % s відсутній.';
$string ['artefacttypeclassmissing'] = 'Типи артефактів повинні реалізовувати клас. Відсутній % s.';
$string ['artefactpluginmethodmissing'] = 'Плагін артефакту % s повинен реалізувати % s і не має.';
$string ['blocktypelibmissing'] = 'Відсутній lib.php для блоку % s в артефакті плагіна % s.';
$string ['unabletosetmultipleblogs'] = 'Увімкнення декількох журналів для користувача % s при копіюванні сторінки % s не вдалося. Це можна встановити вручну на сторінці <a href="%s"> облікового запису </a>. ';
$string ['pleaseloginforjournals'] = 'Ви повинні вийти з системи й увійти назад, перш ніж ви побачите всі журнали та публікації.';
$string ['blocktypemissingconfigform'] = 'Тип блоку % s повинен реалізовувати екземпляр_конфігурації.';
$string ['versionphpmissing1'] = 'Плагін % s % s відсутній version.php. Якщо ви не очікуєте мати плагін % s, видаліть папку на % s. ';
$string ['blocktypeprovidedbyartefactnotinstallable'] = 'Це буде встановлено як частину інсталяції артефакту % s.';
$string ['blockconfigdatacalledfromset'] = 'Configdata не слід встановлювати безпосередньо. Замість цього використовуйте PluginBlocktype :: instance_config_save. ';
$string ['invaliddirection '] = ' Неправильний напрямок % s. ';
$string ['onlyoneprofileviewallowed'] = 'Вам дозволяється лише одна сторінка профілю.';
$string ['onlyoneblocktypeperview'] = 'Неможливо помістити більше ніж один тип блоку % s на сторінку.';

// якщо ви зміните наступні два, обов'язково змініть їх у libroot / errors.php
// якщо вони дубльовані там, у випадку, коли get_string недоступний.
$string ['unrecoverableerror'] = 'Сталася непоправна помилка. Це, мабуть, означає, що ви зіткнулися з помилкою в системі. ';
$string ['unrecoverableerrortitle'] = '% s - Сайт недоступний';
$string ['parameterexception'] = 'Необхідний параметр відсутній.';

$string ['notfound'] = 'Не знайдено';
$string ['notfoundexception'] = 'Сторінку, яку ви шукаєте, не знайдено.';
$string ['accessdenied'] = 'Доступ заборонений';
$string ['accessdeniedobjection'] = 'Відхилено доступ. Заперечення вже вирішено іншим адміністратором. ';
$string ['accessdeniedsuspension'] = 'Цей портфель розглядається.';
$string ['accessdeniedexception'] = 'У вас немає доступу для перегляду цієї сторінки.';
$string ['accessdeniednourlsecret'] = 'Ви не маєте доступу до цієї функції. Будь ласка, вкажіть значення "urlsecret" з вашого файлу config.php як частина URL. ';
$string ['accessdeniedbadge'] = 'У вас немає доступу для перегляду цього значка.';
$string ['siteprivacystatementnotfound'] = 'Заяву про конфіденційність сайту з ідентифікатором % s не знайдено.';
$string ['institutionprivacystatementnotfound'] = 'Заяву про конфіденційність для "% s" з ідентифікатором % s не знайдено.';
$string ['viewnotfoundexceptiontitle'] = 'Сторінка не знайдена';
$string ['viewnotfoundexceptionmessage'] = 'Ви намагалися отримати доступ до сторінки, яка не існує.';
$string ['viewnotfound'] = 'Сторінка з id % s не знайдена.';
$string ['viewnotfoundbyname'] = 'Сторінка% s по% s не знайдена.';
$string ['youcannotviewthisusersprofile'] = 'Ви не можете переглянути профіль цього користувача.';
$string ['invalidlayoutselection'] = 'Ви намагалися вибрати макет, який не існує.';
$string ['invalidnumrows'] = 'Ви спробували створити макет з більшою допустимою кількістю рядків. (Це неможливо; повідомте адміністратора сайту.) ';
$string ['previewimagegenerationfailed'] = 'Вибачте, виникла проблема при створенні попереднього перегляду.';
$string ['viewtemplatenotfound'] = 'Шаблон сторінки за промовчанням не знайдено.';
$string ['artefactnotfoundmaybedeleted'] = 'Не знайдено артефакт з id % s (можливо, його вже видалено?)';
$string ['artefactnotfound'] = 'Artefact with id% s не знайдено';
$string ['artefactsnotfound'] = 'Не знайдено жодного артефакту з ідентифікатором(ами): % s';
$string ['artefactnotinview'] = 'Артефакт % s не на сторінці % s';
$string ['artefactonlyviewableinview'] = 'Артефакти цього типу доступні лише для сторінки.';
$string ['notartefactowner'] = 'Ви не володієте цим артефактом.';
$string ['blockinstancenotfound'] = 'Примірник блоку з id % s не знайдено.';
$string ['interactioninstancenotfound'] = 'Екземпляр дії з id % s не знайдено.';
$string ['invalidviewaction'] = 'Недійсна дія контролю сторінки: % s';
$string ['missingparamblocktype'] = 'Спробуйте вибрати тип блоку, який потрібно додати першим.';
$string ['missingparamcolumn'] = 'Відсутня специфікація стовпця';
$string ['missingparamrow'] = 'Відсутність специфікації рядків';
$string ['missingparamorder'] = 'Немає специфікації замовлення';
$string ['missingparamid'] = 'Відсутній ідентифікатор';
$string ['themenameinvalid'] = 'Ім"я теми "% s" містить недопустимі символи.';
$string ['timezoneidentifierunusable'] = 'PHP на хості вашого сайту не повертає корисного значення для ідентифікатора часового поясу (%% z) - певне форматування дати, наприклад, експорт Leap2A, буде порушено. %% z є кодом форматування дати PHP. Ця проблема зазвичай пов"язана з обмеженням у роботі PHP у Windows. ';
$string ['postmaxlessthanuploadmax'] = 'Ваш параметр post_max_size PHP (% s) менше, ніж ваш параметр upload_max_filesize (% s). Завантаження, що перевищує % s, буде відображати помилку. Зазвичай post_max_size має бути набагато більшим, ніж upload_max_filesize. ';
$string ['smallpostmaxsize'] = 'Ваша установка PHP post_max_size (% s) дуже мала. Завантаження, розмір яких перевищує % s, не зникне без відображення помилки. ';
$string ['notenoughsessionentropy'] = 'Ваша настройка сесії entropy_length PHP занадто мала. Встановіть його як мінімум 16 у вашому php.ini, щоб гарантувати, що згенеровані ідентифікатори сеансів є випадковими та непередбачуваними. ';
$string ['switchtomysqli'] = 'Розширення <strong> mysqli </strong> PHP не встановлено на вашому сервері. Таким чином, Mahara повертається до застарілого оригінального розширення PHP mysql </strong>. Рекомендується встановити <a href="http://php.net/manual/en/book.mysqli.php"> mysqli </a>. ';
$string ['noreplyaddressmissingorinvalid'] = 'Налаштування адреси не є обов"язковим або недійсне. Перевірте налаштування в <a href="%s"> параметрах сайту в налаштуваннях електронної пошти </a>. ';
$string ['openbasedirenabled'] = 'Ваш сервер має обмеження php open_basedir.';
$string ['openbasedirpaths'] = 'Mahara може виконувати лише операції n файлів у межах наступного шляху:% s. ';
$string ['openbasedirwarning'] = 'Деякі запити на зовнішні сайти можуть не завершитися. Це може зупинити оновлення певних каналів. ';
$string ['resavecustomthemes'] = 'Ваше останнє оновлення може зупинити відображення правильно налаштованих тем. Щоб оновити налаштовувану тему, перейдіть до Адміністрування → Установа -> Налаштування, налаштуйте налаштування установи та збережіть форму. <br> Наступні установи використовують налаштовувані теми: ';

$string ['gdlibrarylacksgifsupport'] = 'Встановлена ​​бібліотека PHP GD не підтримує створення і читання зображень GIF. Потрібна повна підтримка для завантаження зображень GIF. ';
$string ['gdlibrarylacksjpegsupport'] = 'Встановлена ​​бібліотека PHP GD не підтримує зображення JPEG / JPG. Потрібна повна підтримка для завантаження зображень JPEG / JPG. ';
$string ['gdlibrarylackspngsupport'] = 'Встановлена ​​бібліотека PHP GD не підтримує зображення PNG. Потрібна повна підтримка для завантаження зображень PNG. ';

$string ['nopasswordsaltset'] = 'Не встановлено пароль для всього сайту. Відредагуйте ваш config.php і встановіть параметр "passwordsaltmain" та секретну фразу. ';
$string ['passwordsaltweak'] = 'Ваш пароль для сайту не є достатньо складним. Відредагуйте config.php і встановіть параметр "passwordsaltmain" на більш довгу секретну фразу.';
$string ['urlsecretweak'] = 'Встановлений $ cfg-> urlsecret для цього сайту не змінювався від значення за замовчуванням. Відредагуйте свій config.php і встановіть для параметра $ cgf-> urlsecret інше значення (або null, якщо ви не бажаєте використовувати urlsecret). ';
$string ['notproductionsite'] = 'Цей сайт не знаходиться у режимі розробника. Деякі дані можуть бути недоступними та / або можуть бути застарілими. ';
$string ['badsessionhandle'] = 'Обробник сеансу "% s" не налаштований правильно. Перевірте налаштування у файлі "config.php". ';
$string ['wrongsessionhandle'] = 'Обробник сеансу збереження "% s" не підтримується в Mahara.';
$string ['nomemcachedserver'] = 'Сервер memcache "% s" недоступний. Будь ласка, перевірте значення $ cfg-> memcacheservers, щоб переконатися, що він правильний ';
$string ['nophpextension'] = 'Розширення PHP "% s" не включено. Увімкніть розширення та перезапустіть веб-сервер або виберіть іншу опцію сеансу. ';
$string ['nomemcacheserversdefined'] = 'Обробник сеансу збереження "% s" не має визначених відповідних серверів. Установіть значення $ cfg-> memcacheservers, наприклад "localhost: 11211". ';
$string ['memcacheusememcached'] = 'Пам"ять сеансу "memcache" застаріла. Використовуйте "memcached". ';
$string ['siteoutofsyncfor'] = 'Цей сайт містить інформацію про базу даних більш нову, ніж файли % s, вказують, що він повинен бути.';
$string ['updatesitetimezone'] = 'Часовий пояс для сайту тепер потрібно встановити через "Налаштувати сайт" → "Параметри сайту" → "Налаштування сайту". Встановіть його там і видаліть рядок $ cfg-> dbtimezone з вашого файлу config.php. ';
$string ['pluginnotactive1'] = 'Плагін "% s" не ввімкнено. Щоб увімкнути його, перейдіть до розділу "Адміністрація" → "Розширення" → "Адміністрування плагінів"';